[app]

# =========================================================
# معلومات التطبيق
# =========================================================

title = Voice Control

package.name = voicecontrol

package.domain = org.voice

source.dir = .

source.include_exts = py,png,jpg,jpeg,kv,atlas,ttf,otf

version = 1.0


# =========================================================
# المكتبات
# =========================================================

requirements = python3,kivy==2.3.0,pyjnius==1.6.1


# =========================================================
# صلاحيات Android
# =========================================================

android.permissions = INTERNET,RECORD_AUDIO


# =========================================================
# اتجاه الشاشة
# =========================================================

orientation = portrait


# =========================================================
# Android SDK / NDK
# =========================================================

android.api = 33

android.minapi = 21

android.ndk = 25b

android.accept_sdk_license = True


# =========================================================
# python-for-android
# =========================================================

# مهم جداً:
# يجب أن يكون هناك حرف v قبل رقم الإصدار.

p4a.branch = v2024.01.21


# =========================================================
# إعدادات إضافية
# =========================================================

fullscreen = 0


[buildozer]

log_level = 2

warn_on_root = 1
